3 Weeks Series/Auxiliary Post Processing/funkysetboundaryfielddambreak/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/*   Windows 32 and 64 bit porting by blueCAPE: http://www.bluecape.com.pt   *\
|  Based on Windows porting (2.0.x v4) by Symscape: http://www.symscape.com   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   nonuniform List<vector> 
2268
(
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
...
)
;

boundaryField
{
    leftWall
    {
        type            fixedValue;
        valueOld        nonuniform List<vector> 
50
(
(0.581 0.581 0)
(0.575 0.575 0)
(0.569 0.569 0)
(0.563 0.563 0)
(0.557001 0.557001 0)
(0.551001 0.551001 0)
(0.545001 0.545001 0)
(0.539001 0.539001 0)
...
)
;
        value           nonuniform List<vector> 
50
(
(1.743 1.743 0)
(1.725 1.725 0)
(1.707 1.707 0)
(1.689 1.689 0)
(1.671 1.671 0)
(1.653 1.653 0)
(1.635 1.635 0)
(1.617 1.617 0)
...
)
;
    }
    rightWall
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    lowerWall
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    atmosphere
    {
        type            pressureInletOutletVelocity;
        value           uniform ( 0 0 0 );
    }
    defaultFaces
    {
        type            empty;
    }
}
