3 Weeks Series/Auxiliary Post Processing/funkysetboundaryfielddambreak/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/*   Windows 32 and 64 bit porting by blueCAPE: http://www.bluecape.com.pt   *\
|  Based on Windows porting (2.0.x v4) by Symscape: http://www.symscape.com   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
2268
(
0
0
0
0
0
0
0
0
...
)
;

boundaryField
{
    leftWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    rightWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    lowerWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    atmosphere
    {
        type            totalPressure;
        rho             rho;
        psi             none;
        gamma           1;
        p0              uniform 0;
        value           uniform 0;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
